# Используем официальный образ Node.js
FROM node:18

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем package.json и package-lock.json для установки зависимостей
COPY package*.json ./

# Устанавливаем зависимости
RUN npm install

# Копируем весь проект в рабочую директорию
COPY . .

# Собираем приложение (для продакшн-сборки, если нужно)
RUN npm run build

# Устанавливаем команду для запуска проекта
CMD ["npm", "start"]

# Открываем порт, на котором приложение будет работать
EXPOSE 3000
